app/views/recipes/show.html.erb

SELECT `measurements`.* FROM `measurements` WHERE `measurements`.`recipe_id` = 54
---
										</tr>
										<% @recipe.measurements.each do |m|%>