app/controllers/ingredientes_controller.rb

SELECT  `ingredients`.* FROM `ingredients` WHERE `ingredients`.`id` = 19 LIMIT 1
---
  def set_ingredient
    @ingredient = Ingredient.find(params[:id])