app/controllers/recipes_controller.rb

SELECT `recipes`.* FROM `recipes`
---
  def index
    query = params[:search]
    @search = Recipe.search do

INSERT INTO `recipes` (`title`, `description`, `ingredients`, `user_id`, `created_at`, `updated_at`) VALUES ('recept1', 'asdlasčldaskč', 'dačlskdasčldkčaskdada', 1, '2016-12-09 17:35:53', '2016-12-09 17:35:53')
INSERT INTO `ingredients` (`name`, `created_at`, `updated_at`) VALUES ('{\"ingredients\"=>\"#<Ingredient::ActiveRecord_Associations_CollectionProxy:0xbb7e230>\\r\\n1', '2016-12-14 15:56:59', '2016-12-14 15:56:59')
INSERT INTO `measurements` (`ingredient_id`, `recipe_id`, `measure`, `created_at`, `updated_at`) VALUES (20, 54, '2', '2016-12-19 18:45:24', '2016-12-19 18:45:24')
---
  def create
    @recipe = current_user.recipes.build(recipe_params)
    @recipe.user = current_user
    @recipe.save
    @measurs = Array.new
    @ingrs = Array.new
    @tgs = Array.new
    #ovo bi trebalo unutar sebe prikupiti sastojke i mjere
    parse_ingredients
    parse_tags
    @recipe.measurements = @measurs
    @recipe.ingredients = @ingrs
    @recipe.recipe_tags = @tgs

    respond_to do |format|
      if @recipe.save

DELETE FROM `recipes` WHERE `recipes`.`id` = 3
---
  def destroy
    @recipe.destroy

SELECT  `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 3 LIMIT 1
---
    def set_recipe
      @recipe = Recipe.find(params[:id])